# Data Cleaning & Handling

## drop()

In [12]:
import pandas as pd

citizens = {
    "Name" : ["Isha", "Rifat", "Munna", "SSB", "Billah", "Tom"],
    "Age" : [19, 20, 21, 22, 23, 24],
    "City" : ["UK", "DHK", "NYC", "LAC", "SYD", "NYC"]
}

df = pd.DataFrame(citizens)

In [2]:
df

     Name  Age City
0    Isha   19   UK
1   Rifat   20  DHK
2   Munna   21  NYC
3     SSB   22  LAC
4  Billah   23  SYD
5     Tom   24  NYC

In [13]:
#Dropping a column

column_dropped_df = df.drop("Age", axis = 1)

In [14]:
column_dropped_df

     Name City
0    Isha   UK
1   Rifat  DHK
2   Munna  NYC
3     SSB  LAC
4  Billah  SYD
5     Tom  NYC

#### Inplace 
* Accessed the main memory & make changes on that if the value is True

In [15]:
df

     Name  Age City
0    Isha   19   UK
1   Rifat   20  DHK
2   Munna   21  NYC
3     SSB   22  LAC
4  Billah   23  SYD
5     Tom   24  NYC

In [16]:
df.drop("Age", axis = 1, inplace = True)

In [17]:
df

     Name City
0    Isha   UK
1   Rifat  DHK
2   Munna  NYC
3     SSB  LAC
4  Billah  SYD
5     Tom  NYC

## fillna()
* Fill missing values in the DataFrame.

In [23]:
AHB_runs = {
    "ODI" : [45, None, 37, 55, None],
    "Test" : [None, None, 66, None, None],
    "T20I" : [None, 25, None, 20, 4]
}
AHB_runs

{'ODI': [45, None, 37, 55, None],
 'Test': [None, None, 66, None, None],
 'T20I': [None, 25, None, 20, 4]}

In [24]:
AHB_runs_with_null = pd.DataFrame(AHB_runs)

In [25]:
AHB_runs_with_null

    ODI  Test  T20I
0  45.0   NaN   NaN
1   NaN   NaN  25.0
2  37.0  66.0   NaN
3  55.0   NaN  20.0
4   NaN   NaN   4.0

In [26]:
AHB_runs_filled = AHB_runs_with_null.fillna(60)

In [27]:
AHB_runs_filled

    ODI  Test  T20I
0  45.0  60.0  60.0
1  60.0  60.0  25.0
2  37.0  66.0  60.0
3  55.0  60.0  20.0
4  60.0  60.0   4.0

In [29]:
AHB_runs_filled.value_counts("ODI")

ODI
60.0    2
37.0    1
45.0    1
55.0    1
Name: count, dtype: int64

## drop_duplicates()

In [34]:
emps = {
    "A" : [1, 2, 1, 2, 3],
    "B" : ["x", "y", "x", "y", "z"]
}

df = pd.DataFrame(emps)

df

   A  B
0  1  x
1  2  y
2  1  x
3  2  y
4  3  z

In [35]:
df.drop_duplicates(inplace = True)

In [36]:
df

   A  B
0  1  x
1  2  y
4  3  z

## replace

In [37]:
data = {
    'A' : [1,2,3,4],
    'B' : ['X','Y','Z','X']
}

df = pd.DataFrame(data)
df

   A  B
0  1  X
1  2  Y
2  3  Z
3  4  X

In [38]:
df.replace({"X" : "W", 4:3, 3:2}, inplace = True)

In [39]:
df

   A  B
0  1  W
1  2  Y
2  2  Z
3  3  W

# Data Aggregation and Grouping

# groupby()
* Group data based on specified columns

In [44]:
import pandas as pd

data = {
    "cat" : ["A", "B", "D", "D", "A"],
    "value" : [10, 20, 15, 25, 30]
}

df = pd.DataFrame(data)

In [45]:
grouped = df.groupby("cat")

In [46]:
for name, group in grouped:
    print(name)

A
B
D

In [47]:
for name, group in grouped:
    print(group)

  cat  value
0   A     10
4   A     30
  cat  value
1   B     20
  cat  value
2   D     15
3   D     25

In [48]:
second_grouped = df.groupby("value")

In [49]:
for name, group in second_grouped:
    print(name)

10
15
20
25
30

In [50]:
for name, group in second_grouped:
    print(group)

  cat  value
0   A     10
  cat  value
2   D     15
  cat  value
1   B     20
  cat  value
3   D     25
  cat  value
4   A     30

## agg()

In [54]:
aggregated = grouped.agg({"value" : ["sum", "mean"]})
aggregated

    value
      sum  mean
cat
A      40  20.0
B      20  20.0
D      40  20.0

# Data Transformation

## pivot_table()

In [56]:
import pandas as pd

data = {
    "Date" : ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    "Name" : ["A", "B", "A", "B"],
    "Price" : [10, 15, 20, 25]
}

df = pd.DataFrame(data)

In [57]:
df

         Date Name  Price
0  2022-01-01    A     10
1  2022-01-01    B     15
2  2022-01-02    A     20
3  2022-01-02    B     25

In [60]:
# Creating a pivot table for summarizing the data

pivot = df.pivot_table(values = "Price", index = "Date", columns = "Name")

In [61]:
pivot

Name         A   B
Date
2022-01-01  10  15
2022-01-02  20  25

# Read/Write CSV/Excel files

## Reading CSV File

In [62]:
import pandas as pd

df = pd.read_csv("Annual-balance-sheets-2007-2022-provisional.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7296 entries, 0 to 7295
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Period                7296 non-null   float64
 1   Inst_sector           7296 non-null   object
 2   Inst_sector_code      7296 non-null   int64
 3   Descriptor            7296 non-null   object
 4   SNA08TRANS            7296 non-null   object
 5   Asset_liability_code  7296 non-null   object
 6   Values                7296 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 399.1+ KB

In [63]:
df.head()

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345970
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance Total financi...,LE00000,AFA0000,99771
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267

In [64]:
df.head(70)

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345970
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance Total financi...,LE00000,AFA0000,99771
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267
...,...,...,...,...,...,...,...
65,2007.03,Central bank,211,Financial liabilities Closing balance financia...,LE00000,AFL0700,0
66,2007.03,Central bank,211,Financial liabilities Closing balance other ac...,LE00000,AFL0800,397
67,2007.03,Central bank,211,Capital Account Closing balances Total non-fin...,LE00000,AN00000,56
68,2007.03,Central bank,211,Capital Account Closing balances Produced non-...,LE00000,AN10000,42
69,2007.03,Central bank,211,Capital Account Closing balances Non-produced ...,LE00000,AN20000,14

In [67]:
df.value_counts("Values")

Values
0         1399
..         305
C          198
16          15
14          13
          ...
236081       1
236423       1
23672        1
236819       1
S            1
Name: count, Length: 4091, dtype: int64

## Writing CSV File

In [68]:
emps = {
    "Name" : ["Rahma Khan Isha", "Raiyaz Rifat", "SSB Rishi", "SZM Munna"], #List as series to python
    "City" : ["Tangail", "Dhaka", "Chittagong", "Rangpur"], #List as series to python
    "Age" : [19, 21, 22, 22] #List as series to python
}

df = pd.DataFrame(emps)

In [69]:
# Writing the df to a csv file

df.to_csv("output.csv", index = False)

## Reading xcel files

In [70]:
df = pd.read_excel("Lec13-CSE115-Pointer-RRa-SupportFile.xlsx")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   0 non-null      float64
 1   Unnamed: 1   12 non-null     object
 2   Unnamed: 2   19 non-null     object
 3   Unnamed: 3   14 non-null     object
 4   Unnamed: 4   0 non-null      float64
 5   Unnamed: 5   2 non-null      object
 6   Unnamed: 6   18 non-null     object
 7   Unnamed: 7   3 non-null      object
 8   Unnamed: 8   0 non-null      float64
 9   Unnamed: 9   0 non-null      float64
 10  Unnamed: 10  17 non-null     object
 11  Unnamed: 11  13 non-null     object
 12  Unnamed: 12  0 non-null      float64
 13  Unnamed: 13  9 non-null      object
 14  Unnamed: 14  11 non-null     object
dtypes: float64(5), object(10)
memory usage: 2.7+ KB

## Writing excel files

In [71]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df.to_excel("xoutput.xlsx", sheet_name = "Sheet1")